export const uiTextsRu = {
  gameHeading: 'Морской бой',
  createGameHeading: 'Создать новую игру',
  joinGameHeading: `Присоединиться к\xa0игре`,
  defaultName1: 'Игрок 1',
  defaultName2: 'Игрок 2',
  enterYourName: 'Введите Ваше\xa0имя',
  createGame: 'Создать игру',
  enterAccessCode: 'Введите код доступа',
  enterGame: 'Войти в\xa0игру',
  sendCode: 'Скопируйте и\xa0отправьте своему оппоненту этот\xa0код для\xa0входа',
  ready: 'Готово!',
  tip: `
  Расставьте все свои\xa0корабли, кликая по\xa0полю.
  Корабли могут быть любой формы и\xa0могут соприкасаться только углами
  `,
  validShips: 'Ваши корабли расставлены по\xa0правилам',
  startGame: 'Начать игру',
  waitForAnotherPlayer: `
  Ваши корабли готовы.
  Ждем игрока, который еще не\xa0расставил свои корабли
  `,
  anotherPlayerIsWaiting: 'Другой игрок только\xa0что расставил корабли и\xa0готов начать. Не\xa0заставляйте его слишком долго ждать:)',
  myShips: 'Мои корабли',
  opponentShips: 'Корабли оппонента',
  yourTurn: 'Ваш ход. Стреляйте, кликая по\xa0полю оппонента',
  opponentTurn: 'Ждем выстрела оппонента',
  endGame: `
  Вы не\xa0успели подбить все корабли оппонента:(
  Победитель - `,
  congrats: 'Игра завершилась Вашей победой! Поздравляем!!!',
  switchToDark: 'Темная тема',
  switchToLight: 'Светлая тема',
}

export const errorMessagesRu = {
  connectionLost: `
  Нет связи с\xa0сервером.
  Попробуйте его\xa0запустить ;D
  Инструкция здесь: https://github.com/022022/battleship-websockets
  `,
  gameFull: 'В\xa0этой игре уже есть два игрока. Уточните код у\xa0своего оппонента и\xa0попробуйте еще\xa0раз',
  wrongCodeOrNoGame: 'Не\xa0удалось найти игру с\xa0таким кодом. Уточните код у\xa0своего оппонента и\xa0попробуйте еще\xa0раз',
  anotherPlayerDisconnected: 'Пропала связь с\xa0другим игроком, игра не\xa0может продолжаться( Обновите страницу, чтобы\xa0начать снова',
  defaultError: 'Что-то пошло не\xa0так, но\xa0мы уже работаем над\xa0этим. Попробуйте обновить страницу и\xa0начать снова',
}